blynkkk/edgent-examples-pio/PIO_Edgent_ESP32/include/Console.h

#include <Blynk/BlynkConsole.h>

BlynkConsole    edgentConsole;

void console_init()
{
#ifdef BLYNK_PRINT
  edgentConsole.begin(BLYNK_PRINT);
#endif

  edgentConsole.print("\n>");

  edgentConsole.addCommand("reboot", []() {
    edgentConsole.print(R"json({"status":"OK","msg":"rebooting wifi module"})json" "\n");
    edgentTimer.setTimeout(50, systemReboot);
  });

  edgentConsole.addCommand("devinfo", []() {
    edgentConsole.printf(
        R"json({"name":"%s","board":"%s","tmpl_id":"%s","fw_type":"%s","fw_ver":"%s","uid":"%s"})json" "\n",
        systemGetDeviceName().c_str(),
        BLYNK_TEMPLATE_NAME,
        BLYNK_TEMPLATE_ID,
        BLYNK_FIRMWARE_TYPE,
        BLYNK_FIRMWARE_VERSION,
        systemGetDeviceUID().c_str()
    );
  });

  edgentConsole.addCommand("connect", [](int argc, const char** argv) {
    if (argc < 2) {
      edgentConsole.print(R"json({"status":"error","msg":"invalid arguments. expected: <auth> <ssid> <pass>"})json" "\n");
      return;
    }
    String auth = argv[0];
    String ssid = argv[1];
    String pass = (argc >= 3) ? argv[2] : "";

    if (auth.length() != 32) {
      edgentConsole.print(R"json({"status":"error","msg":"invalid token size"})json" "\n");
      return;
    }

    edgentConsole.print(R"json({"status":"OK","msg":"trying to connect..."})json" "\n");

    configStore = configDefault;
    CopyString(ssid, configStore.wifiSSID);
    CopyString(pass, configStore.wifiPass);
    CopyString(auth, configStore.cloudToken);

    BlynkState::set(MODE_SWITCH_TO_STA);
  });

  edgentConsole.addCommand("config", [](int argc, const char** argv) {
    if (argc < 1 || 0 == strcmp(argv[0], "start")) {
      BlynkState::set(MODE_WAIT_CONFIG);
    } else if (0 == strcmp(argv[0], "erase")) {
      BlynkState::set(MODE_RESET_CONFIG);
    } else {
      edgentConsole.getStream().println(F("Available commands: start, erase"));
    }
  });

  edgentConsole.addCommand("wifi", [](int argc, const char* argv[]) {
    Stream& output = edgentConsole.getStream();
    if (argc < 1 || 0 == strcmp(argv[0], "show")) {
      output.printf(
          "mac:%s ip:%s (%s [%s] %ddBm)\n",
          getWiFiMacAddress().c_str(),
          WiFi.localIP().toString().c_str(),
          getWiFiNetworkSSID().c_str(),
          getWiFiNetworkBSSID().c_str(),
          WiFi.RSSI()
      );
    } else if (0 == strcmp(argv[0], "scan")) {
      int found = WiFi.scanNetworks();
      for (int i = 0; i < found; i++) {
        bool current = (WiFi.SSID(i) == WiFi.SSID());
        output.printf(
            "%s %s [%s] %s ch:%d rssi:%d\n",
            (current ? "*" : " "), WiFi.SSID(i).c_str(),
            macToString(WiFi.BSSID(i)).c_str(),
            wifiSecToStr(WiFi.encryptionType(i)),
            WiFi.channel(i), WiFi.RSSI(i)
        );
      }
      WiFi.scanDelete();
    } else {
      output.println(F("Available commands: show, scan"));
    }
  });

  edgentConsole.addCommand("firmware", [](int argc, const char** argv) {
    Stream& output = edgentConsole.getStream();
    if (argc < 1 || 0 == strcmp(argv[0], "info")) {
      unsigned sketchSize = ESP.getSketchSize();

      output.printf(" Version:   %s (build %s)\n", BLYNK_FIRMWARE_VERSION, __DATE__ " " __TIME__);
      output.printf(" Type:      %s\n", BLYNK_FIRMWARE_TYPE);
      output.printf(" Platform:  %s\n", BLYNK_INFO_DEVICE);
      output.printf(" SDK:       %s\n", ESP.getSdkVersion());

      if (const esp_partition_t* running = esp_ota_get_running_partition()) {
        output.printf(" Partition: %s (%dK)\n", running->label, running->size / 1024);
        output.printf(" App size:  %dK (%d%%)\n", sketchSize/1024, (sketchSize*100)/(running->size));
        output.printf(" App MD5:   %s\n", ESP.getSketchMD5().c_str());
      }

    } else if (0 == strcmp(argv[0], "rollback")) {
      if (Update.rollBack()) {
        output.print(R"json({"status":"ok"})json" "\n");
        edgentTimer.setTimeout(50, systemReboot);
      } else {
        output.print(R"json({"status":"error"})json" "\n");
      }
    } else {
      output.println(F("Available commands: info, rollback"));
    }
  });

  edgentConsole.addCommand("sysinfo", []() {
    Stream& output = edgentConsole.getStream();
    output.printf(" Uptime:          %s\n",        timeSpanToStr(systemUptime() / 1000).c_str());
    output.printf(" Reset reason:    %s\n",        systemGetResetReason().c_str());
    output.printf("       graceful:  %lu / %lu\n", systemNoInitData.resetCount.graceful,
                                                          systemNoInitData.resetCount.total);
    output.printf(" Chip:            %s rev %d\n", ESP.getChipModel(), ESP.getChipRevision());
    output.printf(" Flash:           %dK, %luM, %s\n", ESP.getFlashChipSize() / 1024,
                                                          ESP.getFlashChipSpeed() / 1000000,
                                                          systemGetFlashMode().c_str());
    output.printf(" Stack unused:    %d\n",        uxTaskGetStackHighWaterMark(NULL));
    output.printf(" Heap free:       %d / %d\n",   ESP.getFreeHeap(), ESP.getHeapSize());
    output.printf("      max alloc:  %d\n",        ESP.getMaxAllocHeap());
    output.printf("      min free:   %d\n",        ESP.getMinFreeHeap());
    if (ESP.getPsramSize()) {
      output.printf(" PSRAM free:      %d / %d\n", ESP.getFreePsram(), ESP.getPsramSize());
      output.printf("      max alloc:  %d\n",      ESP.getMaxAllocPsram());
      output.printf("      min free:   %d\n",      ESP.getMinFreePsram());
    }
#ifdef BLYNK_FS
    uint32_t fs_total = BLYNK_FS.totalBytes();
    output.printf(" FS free:         %d / %d\n",   (fs_total-BLYNK_FS.usedBytes()), fs_total);
#endif
  });

  edgentConsole.addCommand("sys", [](const BlynkParam &param) {
    Stream& output = edgentConsole.getStream();
    const String tool = param[0].asStr();
    if (tool == "coredump") {
      const String cmd = param[1].asStr();
      if (cmd == "clear") {
        systemClearCoreDump();
      } else {
        systemPrintCoreDump(output);
      }
    } else if (tool == "partitions") {
      esp_partition_iterator_t it = esp_partition_find(ESP_PARTITION_TYPE_ANY, ESP_PARTITION_SUBTYPE_ANY, NULL);
      if (it) {
        do {
          const esp_partition_t* p = esp_partition_get(it);
          output.printf("|  %02x  | %02x  | 0x%06X | 0x%06X | %-16s |\n",
            p->type, p->subtype, p->address, p->size, p->label);
        } while (it = esp_partition_next(it));
      }
    } else if (tool == "powersave") {
      const String cmd = param[1].asStr();
      if (!param[1].isValid() || cmd == "show") {
        output.printf("WiFi powersave: %s\n", WiFi.getSleep() ? "on" : "off");
      } else if (cmd == "on") {
        WiFi.setSleep(true);
      } else if (cmd == "off") {
        WiFi.setSleep(false);
      }
    } else if (tool == "nodelay") {
      const String cmd = param[1].asStr();
      if (!param[1].isValid() || cmd == "show") {
        output.printf("TCP nodelay: %s\n", _blynkWifiClient.getNoDelay() ? "on" : "off");
      } else if (cmd == "on") {
        _blynkWifiClient.setNoDelay(true);
      } else if (cmd == "off") {
        _blynkWifiClient.setNoDelay(false);
      }
    } else if (tool == "cpufreq") {
      const String cmd = param[1].asStr();
      if (!param[1].isValid() || cmd == "show") {
        output.printf("CPU freq: %lu MHz\n", getCpuFrequencyMhz());
      } else {
        const unsigned freq = param[1].asInt();
        if (freq == 10 || freq ==  20 || freq ==  40 ||
            freq == 80 || freq == 160 || freq == 240)
        {
          setCpuFrequencyMhz(freq);
        }
      }
    } else if (tool == "drop_stats") {
      systemNoInitData.clear();
    } else {
      output.println(F("Available commands: coredump [show|clear], partitions, powersave [show|on|off], nodelay [show|on|off], cpufreq [show|N(MHz), drop_stats]"));
    }
  });

#ifdef BLYNK_FS

  edgentConsole.addCommand("ls", [](int argc, const char** argv) {
    const char* path = (argc < 1) ? "/" : argv[0];
    File rootDir = BLYNK_FS.open(path);
    while (File f = rootDir.openNextFile()) {
#if defined(BLYNK_USE_SPIFFS) && (ESP_IDF_VERSION < ESP_IDF_VERSION_VAL(4, 0, 0))
      String fn = f.name();
#else
      String fn = f.path();
#endif

      MD5Builder md5;
      md5.begin();
      md5.addStream(f, f.size());
      md5.calculate();
      String md5str = md5.toString();

      edgentConsole.printf("%8d %-24s %s\n",
                            f.size(), fn.c_str(),
                            md5str.substring(0,8).c_str());
    }
  });

  edgentConsole.addCommand("rm", [](int argc, const char** argv) {
    if (argc < 1) return;

    for (int i=0; i<argc; i++) {
      const char* fn = argv[i];
      if (BLYNK_FS.remove(fn)) {
        edgentConsole.printf("Removed %s\n", fn);
      } else {
        edgentConsole.printf("Removing %s failed\n", fn);
      }
    }
  });

  edgentConsole.addCommand("mv", [](int argc, const char** argv) {
    if (argc != 2) return;

    if (!BLYNK_FS.rename(argv[0], argv[1])) {
      edgentConsole.print("Rename failed\n");
    }
  });

  edgentConsole.addCommand("cat", [](int argc, const char** argv) {
    if (argc != 1) return;

    if (!BLYNK_FS.exists(argv[0])) {
      edgentConsole.print("File not found\n");
      return;
    }

    if (File f = BLYNK_FS.open(argv[0], FILE_READ)) {
      while (f.available()) {
        edgentConsole.print((char)f.read());
      }
      edgentConsole.print("\n");
    } else {
      edgentConsole.print("Cannot open file\n");
    }
  });

  edgentConsole.addCommand("echo", [](int argc, const char** argv) {
    if (argc != 2) return;

    if (File f = BLYNK_FS.open(argv[1], FILE_WRITE)) {
      if (!f.print(argv[0])) {
        edgentConsole.print("Cannot write file\n");
      }
    } else {
      edgentConsole.print("Cannot open file\n");
    }
  });

#endif

}

BLYNK_WRITE(InternalPinDBG) {
  String cmd = String(param.asStr()) + "\n";
  edgentConsole.runCommand((char*)cmd.c_str());
}

